//----------------------------------------------------
//Copyright (C), 2004-2011,  luoshitian.
//版权所有 (C), 2004-2011,   罗侍田.
//所属模块:调度器
//作者:  罗侍田.
//版本：V1.0.0
//文件描述:cache操作相关的代码。
//其他说明:
//修订历史:
//2. ...
//1. 日期: 2011-10-21
//   作者:  罗侍田.
//   新版本号: V1.0.0
//   修改说明: 原始版本
//------------------------------------------------------
#include "os_inc.h"
#include "cache.h"	//TODO 这个INCLUDE最终很有可能会直接移到os_inc.h中！

#if cn_cache_used == 1

//----作废cache----------------------------------------------------------------
//功能: 把指令cache和数据cache全部作废，数据cache中的"脏"数据并不写回主存。
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_invalid_all(void)
{
    u32 reg = 0;
#if         defined( arm720t) \
        ||  defined( arm920t) \
        ||  defined( arm922t)\
        ||  defined( arm926ej_s)\
        ||  defined( arm1022e)\
        ||  defined( arm1026ej_s)\
        ||  defined( strong_arm)\
        ||  defined( xscale)
    __asm__(
		"mov	%0,#0 \n\t"
		"mcr	p15,0,%0,c7,c7,0 \n\t"
    	:
    	:"r"(reg)
    	);
#elif       defined( arm940t) ||  defined( arm946e_s)
    __asm__(
		"mov	%0,#0 \n\t"
		"mcr	p15,0,%0,c7,c5,0 \n\t"
		"mcr	p15,0,%0,c7,c6,0 \n\t"
    	:
    	:"r"(reg)
    	);
#endif
}

//----作废指令cache------------------------------------------------------------
//功能: 把指令cache作废
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_invalid_inst(void)
{
    u32 reg = 0;
#if     defined( arm920t) \
    ||  defined( arm922t)\
    ||  defined( arm926ej_s)\
    ||  defined( arm940t)\
    ||  defined( arm946e_s)\
    ||  defined( arm1022e)\
    ||  defined( arm1026ej_s)\
    ||  defined( strong_arm)\
    ||  defined( xscale)
    __asm__(
		"mov	%0,#0 \n\t"
		"mcr	p15,0,%0,c7,c5,0 \n\t"
    	:
    	:"r"(reg)
    	);
#elif defined( arm720t) || defined( arm740t)
    __asm__(
		"mov	%0,#0 \n\t"
		"mcr	p15,0,%0,c7,c7,0 \n\t"
		:
		:"r"(reg)
    	);
#endif
}

//----作废数据cache------------------------------------------------------------
//功能: 把数据cache全部作废，数据cache中的"脏"数据并不写回主存。
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_invalid_data(void)
{
    u32 reg = 0;
#if     defined( arm920t) \
        ||  defined( arm922t)\
        ||  defined( arm926ej_s)\
        ||  defined( arm940t)\
        ||  defined( arm946e_s)\
        ||  defined( arm1022e)\
        ||  defined( arm1026ej_s)\
        ||  defined( strong_arm)\
        ||  defined( xscale)
		__asm__(
			"mov	%0,#0 \n\t"
			"mcr	p15,0,%0,c7,c6,0 \n\t"
			:
			:"r"(reg)
			);
#elif defined( arm720t) || defined( arm740t)
	    __asm__(
			"mov	%0,#0 \n\t"
			"mcr	p15,0,%0,c7,c7,0 \n\t"
			:
			:"r"(reg)
			);
#endif
}

//----使能cache----------------------------------------------------------------
//功能: 使能指令和数据cache
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_enable_all(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x1000 \n\t"
    	"orr	%0, %0, #0x4 \n\t"
		"mcr	p15,0,%0,c1,c0,0 \n\t"
		:
		:"r"(reg)
		);
}

//----使能指令cache------------------------------------------------------------
//功能: 使能指令cache
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_enable_inst(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x1000 \n\t"
		"mcr	p15,0,%0,c1,c0,0 \n\t"
		:
		:"r"(reg)
		);
}

//----使能数据cache------------------------------------------------------------
//功能: 使能数据cache
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_enable_data(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x4 \n\t"
		"mcr	p15,0,%0,c1,c0,0 \n\t"
		:
		:"r"(reg)
		);
}

//----禁止cache----------------------------------------------------------------
//功能: 禁止指令和数据cache
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_disable_all(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x1000 \n\t"
    	"orr	%0, %0, #0x4 \n\t"
		"mcr	p15,0,%0,c1,c0,0 \n\t"
		:
		:"r"(reg)
		);
}

//----禁止指令cache------------------------------------------------------------
//功能: 禁止指令cache
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_disable_inst(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x1000 \n\t"
		"mcr	p15, 0, %0, c1, c0, 0 \n\t"
		:
		:"r"(reg)
		);
}

//----禁止数据cache------------------------------------------------------------
//功能: 禁止数据cache
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_disable_data(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x4 \n\t"
		"mcr	p15,0,%0,c1,c0,0 \n\t"
		:
		:"r"(reg)
		);
}


//----使能写缓冲---------------------------------------------------------------
//功能: 使能写缓冲
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_enable_write_buf(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x8 \n\t"
		"mcr	p15, 0, %0, c1, c0, 0 \n\t"
		:
		:"r"(reg)
		);
}

//----禁止写缓冲---------------------------------------------------------------
//功能: 禁止写缓冲
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_disable_write_buf(void)
{
    u32 reg = 0;
    __asm__(
		"mrc	p15, 0, %0, c1, c0, 0 \n\t"
    	"orr	%0, %0, #0x8 \n\t"
		"mcr	p15,0,%0,c1,c0,0 \n\t"
    	:
    	:"r"(reg)
    	);
}

//----清理数据cache------------------------------------------------------------
//功能: 清理整个数据cache，数据cache中的"脏"数据写回主存，以保持同步。
//参数: 无
//返回: 无
//-----------------------------------------------------------------------------
void cache_clean_data(void)
{
#if defined( arm926ej_s)	  ||  defined( arm1026ej_s)
	__asm__("clean: \n\t"
	    "mrc p15,0,pc,c7,c10,3 \n\t"
	    "bne clean \n\t");
#elif       defined( arm920t) \
        ||  defined( arm922t)\
        ||  defined( arm940t)\
        ||  defined( arm946e_s)\
        ||  defined( arm1022e)
    u32 rd,way,line;
    for(way = 0; way < cn_cache_way; way++)
    {
        //下式计算得到每路的行数
        for(line = 0;line<cn_cache_size/cn_cache_way/cn_cache_line_size; line++)
        {
            rd = (way<<cn_c7_offset_way) + (line<<cn_c7_offset_set);
            __asm__("mcr	p15, 0, %0, c7, c10, 2 \n\t"
            		:
            		:"r"(rd)
            );
        }
    }
#elif defined( arm720t) || defined( arm740t)
//这两cpu只有写通方式，无须清理。
#else
//如果不支持定义的cpu核，此处将编译不过
    不认识的cpu类型
#endif
}


#endif

