//----------------------------------------------------
//Copyright (C), 2004-2011,  djyos team.
//版权所有 (C), 2004-2011,   djyos团队.
//作者：djyos团队
//版本：V1.0.0
//文件描述: 硬件看门狗模块驱动
//其他说明:该模块为djyos标准外设模块
//修订历史:
// 1. 日期: 2011-11-29
//   作者: djyos团队
//   新版本号: V1.0.0
//   修改说明: 原始版本
//------------------------------------------------------
#include "os_inc.h"
#include "cpu_peri.h"



//----启动看门狗-------------------------------------------------------
//功能: 启动看门狗
//参数：无
//返回：无
//----------------------------------------------------------------------------
void wdt_star(void)
{

    //disable watchdog interrupt
    pg_wdt_reg->WTCON &= ~(3<<1);
    //enable Watchdog timer;reset signal.
    pg_wdt_reg->WTCON|=((1<<5)|(1<<0));
}
//----软复位-------------------------------------------------------
//功能: 软件复位。
//参数：无
//返回：无
//注意: 通过调用复位函数实现，真正的复位函数，不是在这里实现
//----------------------------------------------------------------------------
void wdt_reboot(void)
{
    while(1);//到时候，可以调用复位函数，这里先用while(1)代替
}
//----硬件复位-------------------------------------------------------
//功能: 看门狗狗叫，需要进行硬件复位
//参数：无
//返回：无
//----------------------------------------------------------------------------
void wdt_hard_reset(void)
{
    while(1);
    // 1、如果硬件有这个功能，可以设置成立马复位
    // 2、可以设置成修改timeout，立马复位。
}
//----喂狗(清狗)-------------------------------------------------------
//功能: 看门狗喂狗函数
//参数：无
//返回：无
//----------------------------------------------------------------------------
void wdt_clear(void)
{
    pg_wdt_reg->WTCNT=15000;
}
//----看门狗硬件初始化-------------------------------------------------------
//功能: 看门狗硬件初始化
//参数：无
//返回：无
//注意: 根据用户的看门狗初始化，然后和djyos提供的条件连接
//----------------------------------------------------------------------------
void wdt_init_hard(void)
{
    //Prescaler value=100;lock division factor=128 ;PCLK=67.5MHz
    //t_watchdog=1/[PCLK/(Prescaler value+1)/Division_factor]=0.0002
    //disable watchdog
    pg_wdt_reg->WTCON=((100<<8)|(3<<3));
    //看门狗时钟周期T=WTCNT*t_watchdog=3S
    //看门狗喂狗
    pg_wdt_reg->WTDAT=15000;
    pg_wdt_reg->WTCNT=15000;
    
    //以上看门狗初始化，用户可以根据各自平台设置，下面，按照djyos设置
    //设置check_timeout，单位为us，和系统的djy_timer_sync的参数单位一致
	wdt_set_check_timeout(3000*1000);
    wdt_star();
}
