//----------------------------------------------------
//Copyright (C), 2004-2011,  都江堰操作系统开发团队.
//版权所有 (C), 2004-2011,   都江堰操作系统开发团队.
//所属模块:内核模块
//作者:  罗侍田.
//版本：V1.0.0
//文件描述: 消息系统相关的定义
//其他说明:
//修订历史:
//2. ...
//1. 日期: 2011-01-24
//   作者:  罗侍田.
//   新版本号: V1.0.0
//   修改说明: 创建文件
//------------------------------------------------------
#ifndef __msg_h__
#define __msg_h__

#ifdef __cplusplus
extern "C" {
#endif

enum djy_message
{
    enum_stdin;     //标准输入设备上有输入数据，例如鼠标点击
};

#ifdef __cplusplus
}
#endif

#endif //__msg_h__

