//----------------------------------------------------
//Copyright (C), 2004-2011,  djyos team.
//版权所有 (C), 2004-2011,   djyos团队.
//作者：djyos团队
//版本：V1.0.0
//文件描述: 硬件看门狗模块驱动
//其他说明:该模块为djyos标准外设模块
//修订历史:
// 1. 日期: 2011-11-29
//   作者: djyos团队
//   新版本号: V1.0.0
//   修改说明: 原始版本
//------------------------------------------------------
#include "os_inc.h"
#include "cpu_peri.h"

//----启动看门狗-------------------------------------------------------
//功能: 启动看门狗
//参数：无
//返回：无
//----------------------------------------------------------------------------
void wdt_star(void)
{
}
//----软复位-------------------------------------------------------
//功能: 软件复位。
//参数：无
//返回：无
//注意: 通过调用复位函数实现，真正的复位函数，不是在这里实现
//----------------------------------------------------------------------------
void wdt_reboot(void)
{
    while(1);//到时候，可以调用复位函数，这里先用while(1)代替
}
//----硬件复位-------------------------------------------------------
//功能: 看门狗狗叫，需要进行硬件复位
//参数：无
//返回：无
//----------------------------------------------------------------------------
void wdt_hard_reset(void)
{
    while(1);
    // 1、如果硬件有这个功能，可以设置成立马复位
    // 2、可以设置成修改timeout，立马复位。
}
//----喂狗(清狗)-------------------------------------------------------
//功能: 看门狗喂狗函数
//参数：无
//返回：无
//----------------------------------------------------------------------------
void wdt_clear(void)
{
}
//----看门狗硬件初始化-------------------------------------------------------
//功能: 看门狗硬件初始化
//参数：无
//返回：无
//注意: 根据用户的看门狗初始化，然后和djyos提供的条件连接
//----------------------------------------------------------------------------
void wdt_init_hard(void)
{
}
