//========================================================  
// 文件模块说明:                                            
// fpga相关操作函数文件                           
// 文件版本: v1.00                                          
// 开发人员: lst                                            
// 创建时间: 2011.06.01                                     
// Copyright(c) 2011-2011  深圳鹏瑞软件有限公司             
//========================================================  
// 程序修改记录(最新的放在最前面):							
//  <版本号> <修改日期>, <修改人员>: <修改功能概述>			
//========================================================  
//例如：
// V1.02 2004-07-14, 张三: 接收函数增加对报文长度有效性校核
#include "os_inc.h"
#include "fpga.h"

tagFpgaReg volatile * const g_ptFpgaReg = (tagFpgaReg *)0x60000000;

